Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Thanks to hints in your code (such as the `@Blocking` and `@NonBlocking` annotations), Quarkus extensions can decide when the application logic is blocking or non-blocking. If we go back to the HTTP endpoint example from above, the HTTP request is always received on an I/O thread. Then, the extension dispatching that request to your code decides whether to call it on the I/O thread, avoiding thread switches, or on a worker thread. This decision depends on the extension. For example, the Quarkus REST (formerly RESTEasy Reactive) extension uses the `@Blocking` annotation to determine if the method needs to be invoked using a worker thread, or if it can be invoked using the I/O thread.
ja_jp: コード内のヒント（ `@Blocking` や `@NonBlocking` アノテーションなど）のおかげで、Quarkus エクステンションはアプリケーションロジックがブロッキングかノンブロッキングかを判断できます。 先ほどのHTTPエンドポイントの例に戻ると、HTTPリクエストは常にI/Oスレッドで受信されます。そして、リクエストをコードにディスパッチするエクステンションは、スレッドスイッチを回避するためにI/Oスレッドで呼び出すか、ワーカースレッドで呼び出すかを決定します。この判断はエクステンションによって異なります。たとえば、Quarkus REST (旧 RESTEasy Reactive) エクステンションは、 `@Blocking` アノテーションを使用して、メソッドをワーカースレッドで呼び出す必要があるか、I/O スレッドで呼び出せるかを判断します。

source: Thanks to hints in your code (such as the `@Blocking` and `@NonBlocking` annotations), Quarkus extensions can decide when the application logic is blocking or non-blocking. If we go back to the HTTP endpoint example from above, the HTTP request is always received on an I/O thread. Then, the extension dispatching that request to your code decides whether to call it on the I/O thread, avoiding thread switches, or on a worker thread. This decision depends on the extension. For example, the RESTEasy Reactive extension uses the `@Blocking` annotation to determine if the method needs to be invoked using a worker thread, or if it can be invoked using the I/O thread.
ja_jp: コード内のヒント（ `@Blocking` や `@NonBlocking` アノテーションなど）により、Quarkusのエクステンションは、アプリケーションロジックがブロッキングかノンブロッキングかを判断できます。前述のHTTPエンドポイントの例に戻ると、HTTPリクエストは常にI/Oスレッドで受信されます。次に、そのリクエストをコードにディスパッチするエクステンションは、スレッドスイッチを避けるためにI/Oスレッドで呼び出すか、ワーカースレッドで呼び出すかを決定します。この判断は、エクステンションによって異なります。たとえば、RESTEasyのReactiveエクステンションでは、 `@Blocking` アノテーションを使用して、メソッドをワーカースレッドを使用して呼び出す必要があるかどうか、またはI/Oスレッドを使用して呼び出すことができるかどうかを判断します。

source: Thanks to https://graalvm.org/[GraalVM] you can compile your Java application into machine specific code (like you do in Go or C++) and that's what we call *Native mode*.
ja_jp: link:https://graalvm.org/[GraalVM] により、Java アプリケーションをマシン固有のコード (Go や C++ のように) にコンパイルすることができます。これは、*ネイティブモード* と呼ばれます。

source: Thanks to the <a href="https://quarkus.io/version/main/guides/mutiny-primer">Mutiny Reactive API</a> , you can compose asynchronous operations and complete the result when everything is done without blocking the I/O threads. This greatly improves resource consumption and elasticity. Most Quarkus APIs are available in both imperative and reactive. As example, you can use the reactive version of the REST Client:
ja_jp: <a href="https://quarkus.io/version/main/guides/mutiny-primer">Mutiny Reactive API</a>のおかげで、非同期操作を構成し、I/Oスレッドをブロックすることなく、すべてが完了したときに結果を完了することができます。これにより、リソース消費量と弾力性が大幅に向上します。ほとんどのQuarkus APIは、命令型とリアクティブ型の両方で利用できます。例えば、REST Clientのリアクティブバージョンを使用することができます。

source: Thanks to the `quarkus-resteasy-multipart` extension, the default encoding is now UTF-8 and it can be configured if needed. If working with multipart, make sure you use this extension.
ja_jp: `quarkus-resteasy-multipart` エクステンションのおかげで、デフォルトのエンコーディングが UTF-8 になり、必要に応じて設定できるようになりました。マルチパートに取り組む場合は、このエクステンションを使用するようにしてください。

source: Thanks to the build-time optimizations, most of the application’s heavy lifting, such as classpath scanning, configuration loading, and dependency injection setup, happens before the application even starts. This significantly reduces the time it takes to get the application up and ready to serve. The reactive core contributes to this by ensuring that I/O operations are handled with minimal blocking, further reducing the startup latency. The efficient startup process means the application can respond to new load conditions more quickly. This combination supports implementing LightSwitchOps patterns, enabling elasticity while controlling costs.
ja_jp: ビルド時の最適化のおかげで、クラスパススキャン、設定ロード、依存性注入のセットアップといったアプリケーションの重い処理のほとんどは、アプリケーションが起動する前に完了します。これにより、アプリケーションが立ち上がり、サービスを提供する準備が整うまでの時間が大幅に短縮されます。リアクティブコアは、I/O操作が最小限のブロッキングで処理されることを保証することでこれに貢献し、起動レイテンシーをさらに削減します。効率的な起動プロセスは、アプリケーションが新しい負荷条件に迅速に対応できることを意味します。この組み合わせは、LightSwitchOpsパターンを実装し、コストを抑えながら弾力性を実現することをサポートします。

source: Thanks to the community feedback, this new Alpha comes with a lot of bugfixes and improvements, especially for Continuous Testing.
ja_jp: コミュニティからのフィードバックにより、この新しいAlpha版では、特に継続的テストのための多くのバグ修正と改善が行われています。

source: Thanks to the extensions we are using, we can perform the build of a container image using Jib and also enabling the generation of Kubernetes manifests while building the application. For example, the following command will generate a Kubernetes manifest in the `target/kubernetes/` directory and also build and push a container image for the project:
ja_jp: ここで使用しているエクステンションにより、Jib を使用してコンテナーイメージのビルドを実行でき、アプリケーションのビルド中に Kubernetes マニフェストを生成することもできます。たとえば、次のコマンドは、 `target/kubernetes/` ディレクトリーに Kubernetes マニフェストを生成し、プロジェクトのコンテナーイメージをビルドしてプッシュします。

source: Thanks to the new `quarkus-security-webauthn` extension, you can implement WebAuthn authentication in your Quarkus applications.
ja_jp: 新しい `quarkus-security-webauthn` エクステンションのおかげで、QuarkusアプリケーションにWebAuthn認証を実装することができます。

source: Thanks to their stellar startup time and low memory usage, you can implement functions using Quarkus in serverless environments. Quarkus provides Funqy, an approach to writing functions that are deployable to various FaaS environments like AWS Lambda, Azure Functions, Knative, and Knative Events (Cloud Events). It is also usable as a standalone service. With Funqy, a function is just:
ja_jp: Quarkus は起動時間が短く、メモリ使用量が少ないため、サーバーレス環境で関数を実装できます。Quarkus は、AWS Lambda、Azure Functions、Knative、Knative Events (Cloud Events) などのさまざまな FaaS 環境にデプロイ可能な関数を作成するためのアプローチである Funqy を提供します。また、スタンドアロン サービスとしても使用できます。Funqy では、関数は次のようになります。

source: Thanks to their stellar startup time and low memory usage, you can implement functions using Quarkus to be used in serverless environments. Quarkus provides Funqy, an approach to writing functions that are deployable to various FaaS environments like AWS Lambda, Azure Functions, Knative, and Knative Events (Cloud Events). It is also usable as a standalone service.
ja_jp: 驚異的な起動時間と低いメモリ使用量のおかげで、Quarkusを使って関数を実装し、サーバーレス環境で使用することができます。Quarkusは、関数を書くためのアプローチであるFunqyを提供しており、AWS Lambda、Azure Functions、Knative、Knative Events（Cloud Events）など、さまざまなFaaS環境にデプロイ可能です。また、スタンドアロンのサービスとしても使用可能です。

source: Thanks to your feedback, we fixed some more issues in Quarkus 2.0 and we thought a new CR was necessary.
ja_jp: フィードバックのお陰で、Quarkus 2.0ではさらにいくつかの問題を修正し、新しいCRが必要だと考えました。

source: That alone will be enough to initialize a registry client to pull extension catalogs from two registries using their default configurations.
ja_jp: これだけで、デフォルト設定を使用して2つのレジストリーからエクステンションカタログをプルするようにレジストリークライアントを初期化するのに十分です。

source: That approach enables the Quarkus hot reload as it intercepts the HTTP requests. You are still in control of everything related to your application logic.
ja_jp: このアプローチでは、HTTPリクエストをインターセプトするため、Quarkusのホットリロードが可能になります。アプリケーションロジックに関連するすべてのことを制御することができます。

source: That being said, there are cases where you need to make sure that an operation is run on a Vert.x (duplicated) context and not just on any random thread.
ja_jp: しかし、任意のスレッドではなく、Vert.x の (複製された) コンテキストで操作を実行する必要がある場合もあります。

source: That concludes this blog post. The next one will discuss how to receive and produce Cloud Events using the Kafka connector.
ja_jp: 以上でこのブログ記事は終了です。次回は、Kafkaコネクタを使ってクラウドイベントを受信して生成する方法について説明します。

source: That configuration (combined with the declared application endpoints) leads to the following valid URLs if our Quarkus application is running in dev mode:
ja_jp: （宣言されたアプリケーションエンドポイントと組み合わされた）この設定は、Quarkusアプリケーションが開発モードで実行されている場合、次のような有効なURLになります。

source: That is how Quarkus will win over enterprises. And I can see this being in motion.
ja_jp: それが、Quarkusがエンタープライズに勝つ方法です。そして、これが動き出しているのがわかります。

source: That is not very interesting, but the algorithm dynamically adjusts the limit based on the size of the request queue. If the queue is short, more requests can be handled and the limit increases; if the queue is long, fewer requests can be handled and the limit decreases. The limit cannot be increased indefinitely; there's a configurable maximum, by default 1000.
ja_jp: これはそれほど興味深い点ではありませんが、このアルゴリズムはリクエストキューのサイズに基づいて動的に制限を調整します。キューが短い場合、より多くのリクエストが処理でき、制限が増加します。キューが長い場合、処理できるリクエストが減り、制限が減少します。制限を無期限に増やすことはできません。設定可能な最大値があり、デフォルトでは 1000 です。

source: That is used in a simple bean:
ja_jp: それはシンプルな Bean で使われています。

source: That link:{jaxrsapi}/jakarta/ws/rs/Path.html[`@Path`] annotation defines the URI prefix under which those methods will be exposed. It can be empty, or contain a prefix such as `rest` or `rest/V1`.
ja_jp: {jaxrsapi}/jakarta/ws/rs/Path.html[`@Path`] アノテーションは、これらのメソッドが公開される URI の接頭辞を定義します。これは空であるか、あるいは `rest` や `rest/V1` のような接頭辞を含むことができます。

source: That link:{jaxrsapi}/javax/ws/rs/Path.html[`@Path`] annotation defines the URI prefix under which those methods will be exposed. It can be empty, or contain a prefix such as `rest` or `rest/V1`.
ja_jp: {jaxrsapi}/javax/ws/rs/Path.html[`@Path`] アノテーションは、これらのメソッドが公開される URI の接頭辞を定義します。これは空であるか、あるいは `rest` や `rest/V1` のような接頭辞を含むことができます。

source: That means if a platform needs to override a certain property value defined in the platform it is based on, it will need to include its platform properties artifact into the `managedDependencies` section of its BOM before importing the base platform.
ja_jp: つまり、あるプラットフォームがベースとなるプラットフォームで定義されている特定のプロパティ値をオーバーライドする必要がある場合は、ベースとなるプラットフォームをインポートする前に、そのプラットフォームのプロパティアーティファクトをBOMの `managedDependencies` セクションに含める必要があります。

source: That means, if, for example, a matching Maven repository mirror was applied to the <<registry.quarkus.io.maven.repo,registry.quarkus.io>> Maven repository, the <<registry.quarkus.io.maven.repo,registry.quarkus.io>> Maven repository would have to be added to the mirror repository group in the corresponding Maven server instance (e.g. Nexus).
ja_jp: つまり、例えば <<registry.quarkus.io.maven.repo,registry.quarkus.io>> Maven リポジトリに一致する Maven リポジトリミラーを適用した場合、 link:#registry.quarkus.io.maven.repo[registry.quarkus.io] Maven リポジトリを対応する Maven サーバーインスタンス (Nexus など) のミラーリポジトリグループに追加する必要があります。

source: That means, if, for example, a matching Maven repository mirror was applied to the xref:registry.quarkus.io.maven.repo[registry.quarkus.io] Maven repository, the xref:registry.quarkus.io.maven.repo[registry.quarkus.io] Maven repository would have to be added to the mirror repository group in the corresponding Maven server instance (e.g. Nexus).
ja_jp: つまり、例えば、一致するMavenリポジトリミラーが xref:registry.quarkus.io.maven.repo[registry.quarkus.io] Mavenリポジトリに適用された場合、対応するMavenサーバーインスタンス（Nexusなど）のミラーリポジトリグループに xref:registry.quarkus.io.maven.repo[registry.quarkus.io] Mavenリポジトリを追加する必要があることを意味します。

source: That method is invoked on a worker thread because it has a synchronous signature. Previously (before Quarkus 2.2), with RESTEasy _reactive_, it would have been called on the I/O thread. To switch back to that behavior, add `@NonBlocking`:
ja_jp: そのメソッドは、同期シグネチャを持っているため、ワーカースレッドで呼び出されます。以前（Quarkus 2.2以前）のRESTEasyの _reactive_では、I/Oスレッドで呼び出されていました。この動作に戻すには、 `@NonBlocking` を追加します。

source: That model is particularly efficient (low number of threads) and performant (avoid context switches). However, it requires a different development model, and you cannot use _Thread Locals_, as the concurrent requests would see the same value. Indeed, they are all processed by the same thread: the event loop.
ja_jp: このモデルは特に効率的で（スレッド数が少なく）、パフォーマンスも高い（コンテキストスイッチの回避）です。 しかし、異なる開発モデルが必要で、 _スレッドローカルを_ 使うことはできません。 実際、これらはすべて同じスレッド、つまりイベントループで処理されます。

source: That said, Project Leyden is not magic either. In its current form:
ja_jp: とはいえ、Project Leyden も魔法ではありません。現在の形式では以下のようになります。

source: That step is particularly not user-friendly. We plan to improve it.
ja_jp: このステップは特に使い勝手が悪いため、改善を計画しています。

source: That thread can then handle another concurrent request. When the scheduled operation completes, it executes the passed continuation **on the same event loop**.
ja_jp: そのスレッドは別の同時リクエストを処理できます。 スケジュールされた操作が完了すると、渡された継続を *同じイベントループで* 実行します。

source: That way for every change to your app and in particular to your entities, the database schema will be properly recreated and your data fixture (stored in `import.sql`) will be used to repopulate it from scratch. This is best to perfectly control your environment and works magic with Quarkus live reload mode: your entity changes or any change to your `import.sql` is immediately picked up and the schema updated without restarting the application!
ja_jp: そうすることで、アプリケーション、特にエンティティに変更があるたびに、データベーススキーマが適切に再作成され、データフィクスチャ（ `import.sql` に保存）がゼロから再投入されます。これは環境を完全にコントロールするための最良の方法であり、Quarkusのライブリロードモードでは魔法のように機能します。エンティティの変更や `import.sql` へのあらゆる変更が即座に反映され、アプリケーションを再起動しなくてもスキーマが更新されます！

source: That way, the `org.acme:acme-quarkus-bom` platform properties will appear before those provided by the `io.quarkus:quarkus-bom` properties and so will be dominating at build time.
ja_jp: こうすることで、 `org.acme:acme-quarkus-bom` のプラットフォーム・プロパティが `io.quarkus:quarkus-bom` のプラットフォーム・プロパティよりも先に現れる為、ビルドの際に優先されます。

source: That will create a link to a page that renders the data in a table:
ja_jp: これにより、テーブル内のデータをレンダリングするページへのリンクが作成されます。

source: That will create a link to a page that renders the raw data in JSON:
ja_jp: これにより、生データを JSON でレンダリングするページへのリンクが作成されます。

source: That will return only that value in the map:
ja_jp: そうすると、マップの中のその値だけが返されます:

source: That's a good question. In CDI the process of matching a bean to an injection point is *type-safe*. Each bean declares a set of bean types. In our example above, the `Translator` bean has two bean types: `Translator` and `java.lang.Object`. Subsequently, a bean is assignable to an injection point if the bean has a bean type that matches the _required type_ and has all the _required qualifiers_. We'll talk about qualifiers later. For now, it's enough to know that the bean above is assignable to an injection point of type `Translator` and `java.lang.Object`.
ja_jp: 良い質問ですね。CDIでは、Beanをインジェクションポイントにマッチングするプロセスは *タイプセーフ* です。各Beanは、Beanタイプのセットを宣言します。上の例では、 `Translator` Beanには、 `Translator` と `java.lang.Object` の 2 つのBeanタイプがあります。その後、Beanが _必要な型_ にマッチするBean型を持ち、 _必要な_ すべての _修飾子を_ 持っている場合、Beanはインジェクションポイントに代入可能です。この後、修飾子について説明します。今のところ、上記のBeanが `Translator` と `java.lang.Object` のタイプのインジェクションポイントに代入可能であることを知っていれば十分です。

source: That's all there is to it!
ja_jp: それだけだよ!

source: That's all there is to it: with Panache, Hibernate ORM has never looked so trim and neat.
ja_jp: 以上、Panacheを使えばHibernate ORMがこれほどまでにすっきりするのかということでした。

source: That's all there is to it: with Panache, Hibernate Reactive has never looked so trim and neat.
ja_jp: 以上、Panacheを使えば、Hibernate Reactiveがこれほどまでにすっきりするのかということでした。

source: That's all there is to it: with Panache, MongoDB has never looked so trim and neat.
ja_jp: 以上となります: Panacheを使えば、MongoDBがこれほどまでに整然としたものになるのです。

source: That's all you need to do to enable the compression.
ja_jp: これだけで圧縮が有効になります。

source: That's all! Caching technology is already integrated and enabled by default in Quarkus, so it's enough to set which ones are safe to be cached.
ja_jp: 以上です。キャッシュ技術はすでにQuarkusに統合されてデフォルトで有効になってるのでキャッシュしても問題ないものを設定するだけで十分です。

source: That's all, folks!
ja_jp: 以上です！皆さん、よろしくお願いします。

source: That's all. Once the pull request is merged, a scheduled job will check Maven Central for new versions and update the xref:extension-registry-user.adoc[Quarkus Extension Registry].
ja_jp: 以上で完了です。プルリクエストがマージされると、スケジュールされたジョブがMaven Centralの新しいバージョンをチェックし、 link:extension-registry-user.html[Quarkus エクステンションレジストリ]をアップデートします。

source: That's already pretty good, right? But what's even more interesting is that we were able to do much better (see you in the next blog post, remember?).
ja_jp: これだけでも十分に素晴らしいですよね？しかし、さらに興味深いのは、私たちがそれ以上の成果を上げることができた点です (次のブログ投稿でお会いしましょう、覚えていますよね？)。

source: That's exactly what we focused on here, and we hope you'll enjoy building your Quarkus applications faster (and greener!).
ja_jp: まさにそこに私たちは注力しました。Quarkus アプリケーションをより速く（そしてより環境に優しく！）ビルドすることを楽しんでいただければ幸いです。

source: That's how easy it is to have Stork Kubernetes service discovery.
ja_jp: これだけ簡単にStork Kubernetesのサービスディスカバリーができるのです。

source: That's it!
ja_jp: 以上です!

source: That's it! So far we have seen how to configure a pooled client and execute simple queries. We are now ready to develop the data management code and implement our RESTful endpoint.
ja_jp: 以上です。これまで、プールされたクライアントを設定し、単純なクエリーを実行する方法を見てきました。これで、データ管理コードを開発し、RESTful エンドポイントを実装する準備が整いました。

source: That's it! So, we can summarize Cloud Events as _just enough metadata to understand an event_ - its source, an id, a type, and the business data.
ja_jp: これだ!これだ!と思ったイベントをまとめてみました。ということで、クラウドイベントを、 _イベントを理解するために必要な最低限のメタデータ、つまり、イベントの_ ソース、ID、タイプ、ビジネスデータとしてまとめることができます。

source: That's why Cloud Events also proposes bindings. A binding is a set of recommendations specific to one protocol. It explains how each protocol should encode Cloud Events. For example, there is a binding for HTTP, one for Kafka, and another for AMQP.
ja_jp: そのため、Cloud Eventsではバインディングも提案しています。バインディングとは、あるプロトコルに固有の推奨事項のセットです。各プロトコルがどのようにCloud Eventsをエンコードすべきかを説明します。例えば、HTTP用のバインディング、Kafka用のバインディング、AMQP用のバインディングがあります。

source: That's why Quarkus now comes with predefined settings for a lot of well-known providers and link:/guides/security-openid-connect-providers[an extensive documentation] will guide you through setting things up.
ja_jp: そのため、Quarkusには、多くの有名なプロバイダーの設定があらかじめ用意されており、 link:/guides/security-openid-connect-providers[豊富なドキュメント] で設定方法を説明します。

source: That's why we will maintain Quarkus 2.16 with bugfixes and important CVE fixes for a few months so that you have the time to upgrade your applications to Quarkus 3.x.
ja_jp: そのため、Quarkus 2.16のバグフィックスと重要なCVEの修正を数ヶ月間メンテナンスし、アプリケーションをQuarkus 3.xにアップグレードする時間を確保する予定です。

source: That’s why we implemented a Quarkus extension so others can use it more easily and don’t need to reinvent the wheel or need to copy paste things around. How do I do that? Here the Quarkiverse Hub comes in. Quarkiverse is a GitHub organization where developers can host and share their extension with others. There are several benefits you get for free when hosting the extension in Quarkiverse instead of using the good old way of doing all the things on your own. By using Quarkiverse you don’t need to build the artifact, release it with the Sonatype Nexus Manager (or something similar) and distribute it on Maven Central and other repositories. Quarkiverse comes with all these things so you can focus on implementing the extension itself. The following post describes what needs to be done to initialize, implement and share a CloudWatch Quarkus extension.
ja_jp: そのため、私たちはQuarkusのエクステンションを実装しました。これにより、他のユーザーがより簡単にQuarkusを使用できるようになり、車輪の再発明やコピーペーストの必要がなくなりました。どうすればいいのでしょうか？ここで、Quarkiverse Hubの出番です。Quarkiverseは、開発者が自分のエクステンションをホストして他の人と共有できるGitHubの組織です。エクステンションをQuarkiverseでホスティングすることで、従来のように自分ですべての作業を行うのではなく、無料でいくつかのメリットを得ることができます。Quarkiverseを使用すると、アーティファクトをビルドし、Sonatype Nexus Manager（または類似のもの）でリリースし、Maven Centralや他のリポジトリで配布する必要がありません。Quarkiverseにはこれらがすべて付属しているので、エクステンションの実装自体に集中することができます。以下の投稿では、CloudWatch Quarkusエクステンションを初期化、実装、共有するために必要なことを説明します。

source: The link:https://javadoc.io/doc/com.datastax.oss.quarkus/cassandra-quarkus-client/latest/com/datastax/oss/quarkus/runtime/api/session/QuarkusCqlSession.html[`QuarkusCqlSession` interface] gives you access to a series of reactive methods that integrate seamlessly with Quarkus and its reactive framework, Mutiny.
ja_jp: link:https://javadoc.io/doc/com.datastax.oss.quarkus/cassandra-quarkus-client/latest/com/datastax/oss/quarkus/runtime/api/session/QuarkusCqlSession.html[`QuarkusCqlSession` インタフェース] を使用すると、Quarkus およびそのリアクティブフレームワークである Mutiny をシームレスに統合する一連のリアクティブメソッドにアクセスできます。

source: The link:https://javadoc.io/doc/com.datastax.oss.quarkus/cassandra-quarkus-client/latest/com/datastax/oss/quarkus/runtime/api/session/QuarkusCqlSession.html[`QuarkusCqlSession`] bean: this application-scoped, singleton bean is your main entry point to the Cassandra client; it is a specialized Cassandra driver session instance with a few methods tailored especially for Quarkus. Read its javadocs carefully!
ja_jp: link:https://javadoc.io/doc/com.datastax.oss.quarkus/cassandra-quarkus-client/latest/com/datastax/oss/quarkus/runtime/api/session/QuarkusCqlSession.html[`QuarkusCqlSession`] bean: このアプリケーションスコープのシングルトン Bean は、Cassandra クライアントへの主要なエントリーポイントです。これは、Quarkus 用に特別に調整されたメソッドを備えた特殊な Cassandra ドライバーセッションインスタンスです。javadoc をしっかり確認してください。

source: The `ProtectedResource` class, which is used in this code example, might look like this:
ja_jp: このコード例で使用されている `ProtectedResource` クラスは次のようになります。

source: The "Context Pack" is used by a "Prompt Assembly" component to construct an "Enhanced Prompt" that includes the relevant context.
ja_jp: 「Context Pack」は、「Prompt Assembly」コンポーネントによって使用され、関連するコンテキストを含む「Enhanced Prompt」を構築します。

source: The "Enhanced Prompt" is fed into an "LLM (LangChain4j)".
ja_jp: 「Enhanced Prompt」は「LLM (LangChain4j)」にフィードされます。

source: The "LangChain4j" package encapsulates the sequential steps of the CoT process:
ja_jp: 「LangChain4j」パッケージは、CoT プロセスの連続するステップをカプセル化します。

source: The "alwaysRedirect" redirect handler will only be used by the specified REST Client which in this example is the "ExtensionsService" client.
ja_jp: "alwaysRedirect" リダイレクトハンドラーは、指定された REST Client (この例では "ExtensionsService" クライアント) によってのみ使用されます。

source: The "real" components can inject the `TestContext` directly.
ja_jp: 「本物の」コンポーネントは、 `TestContext` を直接注入することができます。

source: The 'authMechanism' attribute selects Basic authentication.
ja_jp: authMechanism 属性は Basic 認証を選択します。

source: The 'authMechanism' attribute selects Form-based authentication.
ja_jp: authMechanism 属性はフォームベースの認証を選択します。

source: The (killer) feature proposed by our extension is to greet the user. To do so, our extension will deploy, in the user application, a Servlet exposing the HTTP endpoint `/greeting` which responds to the GET verb with a plain text `Hello`.
ja_jp: ここでのエクステンションの素晴らしい機能は、ユーザーに挨拶をすることです。これを行うには、このエクステンションはユーザーアプリケーションで、平文 `Hello` で GET 動詞に応答する HTTP エンドポイント `/greeting` を公開するサーブレットを展開します。

source: The **BIG** warning
ja_jp: **大きな** 警告

source: The **Keycloak Admin** link is easy to find in Dev UI:
ja_jp: **Keycloak Admin** リンクは、Dev UI で簡単に見つけることができます。

source: The **Liveness** probe for both inbound and outbound channels reports *OK* when the connection is established with the broker **AND** that no failures have been caught.
ja_jp: 着信チャネルと発信チャネルの **Liveness** プローブは、ブローカーとの接続が確立され、**かつ** 失敗が発見されなかった場合に、*OK* を報告します。

source: The *Workspace* view
ja_jp: *Workspace* ビュー

source: The *deployment module* which is used during the augmentation phase of the build, it describes how to "deploy" a library following the Quarkus philosophy. In other words, it applies all the Quarkus optimizations to your application during the build. The deployment module is also where we prepare things for GraalVM's native compilation.
ja_jp: ビルドの拡張フェーズで使用される *デプロイモジュール* で、Quarkus の概念に従ったライブラリを「デプロイ」する方法を説明しています。つまり、ビルド中にアプリケーションに Quarkus のすべての最適化を適用します。このデプロイメントモジュールは、GraalVM のネイティブコンパイルのための準備をする場所でもあります。
